Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/pre_school_education_and_childcare/early_childhood_education.html.txt.tmx
Source language: en
Languages: ga

source: • Role of the Department of Education and Skills in early education
ga: • Luathoideachais agus an Roinn Oideachais agus Scileanna

source: • Government policy on early childhood education
ga: • Polasaí an Rialtais maidir le forbairt luathoideachais

source: Early childhood education generally means education before the start of formal schooling or before the age at which children are generally required to attend school
ga: Ciallaíonn luathoideachas don óige, go ginearálta, an t-oideachas a fhaigheann leanaí sula gcuirtear tús le scolaíocht fhoirmiúil nó roimh an aois a bhíonn ar leanaí freastal ar scoil, go ginearálta

source: It covers the period from birth to 6 years
ga: Cumhdaíonn sé an tréimhse ó bhreith an linbh go dtí aois 6 bliana

source: Legislation on school attendance requires children to be at school (or receiving an education) from the age of 6
ga: Ceanglaíonn an reachtaíocht maidir le freastal ar scoil go bhfreastalaíonn leanaí ar scoil (nó go gcuirtear oideachas orthu) ó aois 6 bliana ar aghaidh

source: In practice, almost all 5-year-olds and about half of 4-year-olds actually attend primary schools
ga: I gcleachtas, tarlaíonn go bhfreastalaíonn nach mór gach leanbh 5 bliana d’aois agus leath na leanaí 4 bliana d’aois ar bhunscoileanna

source: Early childhood education services include infant classes in primary schools and a range of childcare and preschool services
ga: Áirítear le seirbhísí luathoideachais don óige ranganna naíonáin i mbunscoileanna agus réimse de sheirbhísí cúram leanaí agus réamhscoile

source: Pre-school childcare services are regulated by Child and Family Agency
ga: Déanann an Ghníomhaireacht um Leanaí agus an Teaghlach seirbhísí cúram leanaí réamhscoile a rialáil

source: Early Childhood Care and Education (ECCE) Scheme
ga: An Scéim um Chúram agus Oideachas na Luath-Óige (COLO)

source: The Early Childhood Care and Education (ECCE) Scheme provides early care and education for children of pre-school age
ga: Cuireann an Scéim um Chúram agus Oideachas na Luath-Óige (ECCE) cúram agus oideachas luath-óige ar fáil do leanaí in aois réamhscoile

source: In general, the provision amounts to 3 hours per day, 5 days a week over certain number of weeks for children enrolled in participating playschools
ga: Go ginearálta, is ionann an soláthar agus 3 uair an chloig in aghaidh an lae, 5 lá sa tseachtain thar líon áirithe seachtainí do pháistí atá cláraithe i naíonraí rannpháirteacha

source: The ECCE scheme is administered by the Department of Children and Youth Affairs
ga: Riarann an Roinn Leanaí agus Gnóthaí Óige Scéim COLO

source: Role of the Department of Education and Skills in early education
ga: Luathoideachais agus an Roinn Oideachais agus Scileanna

source: The involvement of the Department of Education and Skills in early childhood education focuses mainly on interventions for children who are disadvantaged or have special needs
ga: Tá an ról a ghlacann an Roinn Oideachais agus Scileanna i luathoideachais don óige dírithe ar idirghábhail do pháistí faoi míbhuntáiste nó iad siúd a bhfuil riachtanais speisialta acu

source: The Early Years Education Policy Unit of the Department of Education and Skills and the Department of Children and Youth Affairs work on policy issues affecting early childhood care and education
ga: Oibríonn an tAonad Beartais um Oideachas sna Luathbhlianta den Roinn Oideachais agus Scileanna agus Oifig an Aire Leanaí agus Gnóthaí Óige ar cheisteanna beartais a bhfuil tionchar acu ar oideachas agus luath-chúram leanaí

source: Infant classes in primary school
ga: Ranganna Naíonán sna bunscoileanna

source: There is a special grant allocation to national schools to help buy equipment and materials for infant classes in primary schools
ga: Tá deontas speisialta ceadaithe do scoileanna náisiúnta le treallamh agus ábhair a cheannach do ranganna naíonán

source: The Early Start Programme aims to tackle educational disadvantage by targeting children who are at risk of not reaching their potential within the education system
ga: Sí an aidhm atá ag an gClár an Túis Luaith ná dul i ngleic le míbhuntáiste oideachais tré pháistí a aimsiú atá i mbaol nach mbainfidh siad amach a gcumas lastigh den chóras oideachais

source: It is a one-year preventative intervention scheme offered to pre-school children (3 to 4 years old) in some schools in disadvantaged areas
ga: Scéim sheachanta idirghábhála bliana a chuirtear ar fáil do i scoileanna faoi leith atá i gceantair aitheanta faoi mhíbhuntáiste in Éirinn é an Clár Píolótach Túsluath Réamhscoile

source: Children under 4 with special needs
ga: Páistí faoi 4 bliana d'aois le riachtanais speisialta

source: Local Health Offices and/or voluntary bodies provide services for young children with severe or profound disabilities
ga: Soláthraíonn Oifigí Áitiúla Sláinte agus/nó comhlachtaí deonacha seirbhísí do leanaí óga atá faoi mhíchumas tromchúiseach nó trom

source: Pre-school children do not have a specific right to education
ga: Níl ceart ar leith chun oideachais ag leanaí réamhscoile

source: However, they are entitled to certain health services which are related to education
ga: Tá siad i dteideal roinnt seirbhísí sláinte a fháil a bhaineann leis an oideachas, áfach

source: The Health Service Executive is responsible for providing psychological services and speech and language therapy services for pre-school children with disabilities who are assessed as needing these services
ga: Tá Feidhmeannacht na Seirbhís Sláinte freagrach as seirbhísí síceolaíocha agus seirbhísí teiripe urlabhra agus teanga a sholáthar do leanaí réamhscoile atá faoi mhíchumas a ndearnadh measúnú orthu agus ar deimhníodh go dteastaíonn na seirbhísí seo uathu

source: Assessments of children under the age of 5 are carried out under the assessment of need provisions of the Disability Act 2005
ga: Tugtar faoi mheasúnuithe ar leanaí faoi aois 5 bliana faoi fhorálacha um measúnú ar riachtanais an Achta um Míchumas, 2005

source: The Visiting Teacher Service of the Department of Education and Skills provides a service to young children with visual and/or hearing impairment, from the age of 2 years
ga: Soláthraíonn Seirbhís na Múinteoirí Cuartaíochta de chuid na Roinne Oideachais agus Scileanna seirbhís do leanaí óga a bhfuil lagú amhairc agus/nó éisteachta orthu, ó aois 2 bhliain ar aghaidh

source: There are a small number of special pre-school class units for children with autistic spectrum disorders
ga: Tá líon beag d’aonaid speisialta rang réamhscoile ann do leanaí ar a bhfuil neamhoird de chuid speictream an uathachais

source: These units are attached to primary schools
ga: Bíonn na haonaid seo ceangailte le bunscoileanna

source: It was announced in Budget 2016 that a number of supports to enable children with disabilities to fully participate in pre-school care and education will be phased in during 2016
ga: Fógraíodh i mBuiséad 2016 go ndéanfar roinnt tacaíochtaí do leanaí faoi mhíchumas ionas gur féidir leo a bheith rannpháirteach go hiomlán i gcúram agus oideachas réamhscoile a chéimniú isteach le linn 2016

source: Supports will include grants for equipment, appliances, minor alterations, access to therapeutic intervention and training for childcare staff
ga: Áireofar ar na tacaíochtaí sin deontais do threalamh, fearais, athruithe beaga, rochtain ar idirghabháil theiripeach agus oiliúint d’fhoireann cúram leanaí

source: Government policy on early childhood education
ga: Polasaí an Rialtais maidir le forbairt luathoideachais

source: The White Paper on Early Childhood Education 'Ready to Learn' is concerned with children from birth to 6 years
ga: Baineann an Páipéar Bán, Léamh le foghlaim le luathoideachas páistí idir 0-6 bliana

source: It sets out the core objective of early childhood education as 'supporting the development and educational achievement of children through high quality early education, with particular focus on the target groups of the disadvantaged and those with special needs'
ga: Tá príomhchuspóirí an luathoideachais leagtha amach mar "ag tabhairt tacaíochta do chur i gcrích oideachais agus forbairt páistí tré luathoideachas de ardchaighdeán a chur ar fáil, ag díriú isteach go háirithe ar ghrúpaí faoi míbhuntáiste agus iad siúd le riachtanais speisialta"

source: It sets out a number of guiding principles:
ga: Tá cúpla prionsabal treorach leagtha síos:

source: • Quality will underpin all aspects of early education provision
ga: • Beidh ardchaighdeán ar gach gné de sholáthar luathoideachais

source: • The State will build on existing provision and use the existing regulatory framework, where possible
ga: • Déanfaidh an Stát forbairt ar an soláthar atá ann faoi láthair agus an gréasán rialacháin atá ann a úsaid chomh fada agus is féidir

source: • Implementation will be undertaken on a gradual, phased basis to allow all the participants in the system to prepare adequately for the challenges that lie ahead
ga: • Déanfar cur i bhfeidhm de réir a chéile ar bhonn céimeanna, le déanamh cinnte go bhfuil na rannpháirtithe uilig sa gcóras ullmhaithe do na dúshláin atá rompu

source: • Progress will be achieved through a process of consultation, dialogue and partnership
ga: • Déanfar dul chun cinn tré phróiséis comhairleoireachta, comhráití agus páirtíochta

source: The White Paper proposes early support for families of children with special needs; such parents should have access to an early education expert, initially as an advisor to parents, then as a teacher
ga: Molann an páipéar bán go dtabharfaí tacaíocht luath do theaghlaigh le páistí le riachtanais speisialta. Ba cheart go mbeadh saineolaí luathoideachais ar fáil mar chomhairleoir do na tuismitheoirí ag an tús ansin mar mhúinteoir

source: Síolta: the National Framework for Quality in Early Childhood Education was published in 2006
ga: Is féidir le soláthróirí eile a chomhlíonann an caighdeán atá leagtha síos, aitheantas speisialta a fháil tré bhronnadh an marc Caighdeán in Oideachas (QE)

source: The Early Years Education Policy Unit of the Department of Education and Skills manages the implementation of Síolta
ga: Baineann an marc QE le caighdeán oideachais a bhaineann le curaclam, modhanna, cáilíochtaí agus traenáil foirne

source: The National Council for Curriculum and Assessment has developed Aistear: the Early Childhood Curriculum Framework, for children from birth to 6 years of age
ga: Ba í aidhm an LFOL luathoideachas a fhorbairt agus a chomhordú de réir na gcuspóirí sa Pháipéar Bán Ready to Learn agus comhairle a chur ar an Roinn Oideachais agus Scileanna maidir le ceisteanna polasaí sa réimse seo

source: This framework, published in 2009, describes the types of learning that are important for children of this age group and sets out broad learning goals for all children
ga: Rinne an Chomhairle Náisiúnta Curaclaim agus Measúnachta forbairt ar Aistear: Creat-churaclam na Luath-Óige a lainseáileadh i bhfómhair 2009
